Stachu1/STM32_Watch/firmware/main.c
// Temperature mode: map IMU temperature to hand position
void Mode_Temperature_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_h_idx = 0;
    static u8 hand_m_idx = 0;

    if (reset)
    {
        last_update = 0;
        u32 temp_mC = IMU_Get_Temp();
        Print_str("IMU Temperature: ");
        Print_u32(temp_mC);
        Print_str(" mC\n");

        if (temp_mC == 0)
        {
            hand_h_idx = 0;
            hand_m_idx = 0;
            Hand_Set(0, 12);
            Hand_Set(1, 12);
            Hand_Set(2, 0);
            return;
        }

        // Map 0°C-60°C to 0-12 hand_h index (5°C per step)
        // and 0.5°C per step for hand_m index
        hand_h_idx = temp_mC / 5000;
        hand_m_idx = (temp_mC - hand_h_idx * 5000) / 500;
        if (hand_h_idx > 12) hand_h_idx = 12;
        if (hand_m_idx > 12) hand_m_idx = 12;

        Hand_Set(0, 1);
        Hand_Set(1, 1);
        Hand_Set(2, 0);
        return;
    }

    // Wait for hands position to be pulled from new_position
    if (hands[0].new_position != 255) last_update = millis;

    // Update hand positions gradually for smooth animation
    if ((hands[0].position < hand_h_idx || hands[1].position < hand_m_idx) && millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        if (hands[0].position < hand_h_idx)
        {
            Hand_Set(0, hands[0].position + 1);
        }
        if (hands[1].position < hand_m_idx)
        {
            Hand_Set(1, hands[1].position + 1);
        }
    }
}


void Mode_Time_Setting_Handler(b8 reset)
{
    static u32 last_update = 0;
    static enum {
        ENTRY,
        SET_HOURS,
        SET_MINUTES,
    } stage;
    static u8 h = 0, m = 0;

    if (reset)
    {
        // On entry, read RTC and round min down to nearest 5
        stage = ENTRY;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    switch (stage)
    {
    case ENTRY:
        if (millis - last_update >= STATS_FRAME_TIME / 2)
        {
            last_update = millis;
            Hand_Set(0, (hands[0].position == 12) ? 1 : hands[0].position + 1);
        }
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_HOURS;
            Print_str("Setting Hours\n");
            h = 12;
            Hand_Set(0, h);
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            current_mode = MODE_PENDULUM_SIM;
            Mode_Particle_Sim_Handler(true);
        }
        break;
    case SET_HOURS:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_MINUTES;
            Print_str("Setting Minutes\n");
            Hand_Set(0, h);
            m = 60;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            h = (h == 12) ? 1 : h + 1;
            Hand_Set(0, h);
        }
        break;
    case SET_MINUTES:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            current_mode = MODE_TIME;
            RTC_Set_Time(h, m, 0);

            // Set hand new_positions based on current time
            Hand_Set(0, h);
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
            Hand_Set(2, 12);
            Print_str("Time Set\n");
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            m = (m > 55) ? 5 : m + 5;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        break;
    }
}

// Particle sim mode: display a simple pendulum simulation
void Mode_Particle_Sim_Handler(b8 reset)
{
    static u32 last_update = 0;
    static q32 alpha = 0;
    static q32 omega = 0;

    if (reset)
    {
        alpha = 0;
        omega = 0;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    // Update simulation every 10ms for smooth animation
    if (millis - last_update >= PENDULUM_SIM_DT)
    {
        last_update = millis;

        // Get raw accel data from IMU
        i16 raw_x, raw_y, raw_z;
        IMU_Get_Accel(&raw_x, &raw_y, &raw_z);

        // Convert raw accel (+/- 4g) to q32
        q32 accel_x = (q32)raw_x << 3;
        q32 accel_y = (q32)raw_y << 3;

        // Scale down angle to fit 64 sin table
        u8 table_idx = (alpha >> (FIXED_SHIFT - 6))  & 63;
        q32 sin_v = SIN_LUT[table_idx];
        q32 cos_v = SIN_LUT[(table_idx + 16) & 63];

        // Rotate accel vector by alpha to align with hand and apply as acceleration to omega
        q32 accel_aligned = -(accel_x >> (FIXED_SHIFT / 2)) * (sin_v >> (FIXED_SHIFT / 2));
        accel_aligned -= (accel_y >> (FIXED_SHIFT / 2)) * (cos_v >> (FIXED_SHIFT / 2));

        // Integrate accel to get angular velocity
        // Multiply by dt and 1/(2*Pi*r) ~= 11
        // Divide by 1000 to convert ms to s
        omega += (accel_aligned * PENDULUM_SIM_DT * 11) >> 10;

        // Multiply by friction factor (0.98) to prevent runaway and add damping
        omega -= (omega * PENDULUM_FRICTION) >> FIXED_SHIFT;

        // Integrate omega to get angle
        // Multiply by dt and divide by 1000 to convert ms to s
        alpha += (omega * PENDULUM_SIM_DT) >> 10;

        // Add 1/12/2 for proper rounding
        u32 hand_pos = alpha + FIXED_ONE / 24;

        // Map to 0-255
        hand_pos = (hand_pos >> (FIXED_SHIFT - 8)) & 0xFF;

        // Mpa to 1-12 hand index (avoiding division)
        hand_pos = ((hand_pos * 3) >> 6);
        Hand_Set(0, (hand_pos == 0) ? 12 : hand_pos);

        if (omega > PENDULUM_SIM_INACTIVITY_SPEED || -omega > PENDULUM_SIM_INACTIVITY_SPEED)
        {
            last_activity = millis;
        }
    }
}

// ====== Power Management =====

// Enter Stop Mode for deep sleep with low power consumption
void Enter_Stop_Mode(void)
{
    // Disable RTC wakeup timer
    EXTI->IMR &= ~EXTI_IMR_IM20;

    // Deinit UART & ADC
    UART_Deinit();
    ADC_Deinit();

    // Set IMU to 26Hz
    u8 buf = (0x2 << 4) | (0x2 << 2);
    I2C_Write(IMU_ADDR, 0x10, &buf, 1);

