Stachu1/STM32_Watch/firmware/main.c
    // Reset Hands
    Hand_Set(0, 0);
    Hand_Set(1, 0);
    Hand_Set(2, 0);
    while (hands[0].new_position != 255) Spin(1);

    // Make sure all LED pins are low
    GPIOA->BSRR = 0b1000011110010 << 16;
    GPIOB->BSRR = 0b111101100 << 16;

    // Ensure all I2C transmissions are complete
    while (I2C1->ISR & I2C1_ISR_BUSY);
    I2C1->ICR |= I2C1_ICR_STOPCF;

    TIM21->CR1 &= ~TIM21_CR1_CEN;
    RCC->APB2ENR &= ~RCC_APB2ENR_TIM21EN;

    // PWR Control: LPSDSR (Low-power regulator) + Clear PDDS (Stop Mode)
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_LPSDSR;
    PWR->CR &= ~PWR_CR_PDDS;

    // Set SLEEPDEEP bit in System Control Register
    SCB->SCR |= SCB_SCR_SLEEPDEEP;

    // Clear Wakeup Flag
    PWR->CR |= PWR_CR_CWUF;

    // Wait For Interrupt
    __asm volatile ("wfi");
}

// Restore clock settings after waking up from Stop Mode
void Wakeup_Handler(void)
{
    // Enable PWR clock
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;

    // Set voltage regulator to 1.2V (Range 3)
    while (PWR->CSR & PWR_CSR_VOSF) __asm__ volatile ("nop");
    BF_SET(PWR->CR, PWR_CR_VOS, 0x3); 
    while (PWR->CSR & PWR_CSR_VOSF) __asm__ volatile ("nop");

    // Enable clocks for peripherals
    RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;
    TIM21->CR1 |= TIM21_CR1_CEN;
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    // Reinit peripherals
    GPIO_Init();
    UART_Init();
    ADC_Init();

    // Reset variables
    millis = 0;
    last_activity = 0;
    current_mode = MODE_TIME;

    // Re-enable RTC wakeup interrupt and update hands to current time
    EXTI->IMR |= EXTI_IMR_IM20;
    RTC_Set_Hands();

    // Set IMU back to 416Hz, +/- 4g
    u8 buf = (0x6 << 4) | (0x2 << 2);
    I2C_Write(IMU_ADDR, 0x10, &buf, 1);
}
